app/controllers/sessions_controller.rb

  def create

    if request.env["omniauth.auth"]
      # log in with omniauth data
      oauth_username = request.env["omniauth.auth"]["info"]["nickname"]
      if user = User.find_by(:name => oauth_username)
        # if already a user in the db.
        token = Auth.create_token({:name=> user.name, :id=> user.id})
        # pass token to frontend as param to be stored in window.localstorage.token
        redirect_to "http://localhost:3000/login/github/?token=#{token}&name=#{user.name}&id=#{user.id}"
      else
        user = User.new(:name => oauth_username, :password => SecureRandom.base36)
        # creates a new user based on GitHub credentials.
        if user.save
          token = Auth.create_token({:name=> user.name, :id=> user.id})
          # pass token to frontend as param to be stored in window.localstorage.token
          redirect_to "http://localhost:3000/login/github/?token=#{token}&name=#{user.name}&id=#{user.id}"
        else
          # pass error to frontend as param to be processed accordingly.
          redirect_to "http://localhost:3000/login/github/?token=error"
        end
      end



    else

      # Normal login with username and password
      user = User.find_by(:name => sessionParams[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Bobby bob"], ["LIMIT", 1]]